zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32f0xx/drivers/include/stm32f0xx_ll_rtc.h
/**
  ******************************************************************************
  * @file    stm32f0xx_ll_rtc.h
  * @author  MCD Application Team
  * @version V1.4.0
  * @date    27-May-2016
  * @brief   Header file of RTC LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F0xx_LL_RTC_H
#define __STM32F0xx_LL_RTC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx.h"

/** @addtogroup STM32F0xx_LL_Driver
  * @{
  */

#if defined(RTC)

/** @defgroup RTC_LL RTC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup RTC_LL_Private_Constants RTC Private Constants
  * @{
  */
/* Masks Definition */
#define RTC_INIT_MASK                 ((uint32_t)0xFFFFFFFFU)
#define RTC_RSF_MASK                  ((uint32_t)0xFFFFFF5FU)

/* Write protection defines */
#define RTC_WRITE_PROTECTION_DISABLE  ((uint8_t)0xFFU)
#define RTC_WRITE_PROTECTION_ENABLE_1 ((uint8_t)0xCAU)
#define RTC_WRITE_PROTECTION_ENABLE_2 ((uint8_t)0x53U)

/* Defines used for the bit position in the register and perform offsets */
#define RTC_POSITION_TR_HT            (uint32_t)20U
#define RTC_POSITION_TR_HU            (uint32_t)16U
#define RTC_POSITION_TR_MT            (uint32_t)12U
#define RTC_POSITION_TR_MU            (uint32_t)8U
#define RTC_POSITION_TR_ST            (uint32_t)4U
#define RTC_POSITION_TR_SU            (uint32_t)0U
#define RTC_POSITION_DR_YT            (uint32_t)20U
#define RTC_POSITION_DR_YU            (uint32_t)16U
#define RTC_POSITION_DR_MT            (uint32_t)12U
#define RTC_POSITION_DR_MU            (uint32_t)8U
#define RTC_POSITION_DR_DT            (uint32_t)4U
#define RTC_POSITION_DR_DU            (uint32_t)0U
#define RTC_POSITION_DR_WDU           (uint32_t)13U
#define RTC_POSITION_ALMA_DT          (uint32_t)28U
#define RTC_POSITION_ALMA_DU          (uint32_t)24U
#define RTC_POSITION_ALMA_HT          (uint32_t)20U
#define RTC_POSITION_ALMA_HU          (uint32_t)16U
#define RTC_POSITION_ALMA_MT          (uint32_t)12U
#define RTC_POSITION_ALMA_MU          (uint32_t)8U
#define RTC_POSITION_ALMA_SU          (uint32_t)0U
#define RTC_POSITION_ALMA_ST          (uint32_t)4U
#define RTC_POSITION_PRER_PREDIV_A    (uint32_t)16U
#define RTC_POSITION_ALMA_MASKSS      (uint32_t)24U
#define RTC_POSITION_TS_HU            (uint32_t)16U
#define RTC_POSITION_TS_MNU           (uint32_t)8U
#define RTC_POSITION_TS_WDU           (uint32_t)13U
#define RTC_POSITION_TS_MU            (uint32_t)8U

/* Defines used to combine date & time */
#define RTC_OFFSET_WEEKDAY            (uint32_t)24U
#define RTC_OFFSET_DAY                (uint32_t)16U
#define RTC_OFFSET_MONTH              (uint32_t)8U
#define RTC_OFFSET_HOUR               (uint32_t)16U
#define RTC_OFFSET_MINUTE             (uint32_t)8U

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RTC_LL_Private_Macros RTC Private Macros
  * @{
  */
/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RTC_LL_ES_INIT RTC Exported Init structure
  * @{
  */

/**
  * @brief  RTC Init structures definition
  */
typedef struct
{
  uint32_t HourFormat;   /*!< Specifies the RTC Hours Format.
                              This parameter can be a value of @ref RTC_LL_EC_HOURFORMAT
                              
                              This feature can be modified afterwards using unitary function
                              @ref LL_RTC_SetHourFormat(). */

  uint32_t AsynchPrescaler; /*!< Specifies the RTC Asynchronous Predivider value.
                              This parameter must be a number between Min_Data = 0x00 and Max_Data = 0x7F
                              
